_files/Rate/rate-reauest.xml

<Envelope
    xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body
        xmlns="http://schemas.xmlsoap.org/soap/envelope/">
        <RateRequest
            xmlns="http://fedex.com/ws/rate/v24">
            <WebAuthenticationDetail>
                <UserCredential>
                    <Key>************</Key>
                    <Password>************</Password>
                </UserCredential>
            </WebAuthenticationDetail>
            <ClientDetail>
                <AccountNumber>************</AccountNumber>
                <MeterNumber>************</MeterNumber>
            </ClientDetail>
            <Version>
                <ServiceId>crs</ServiceId>
                <Major>24</Major>
                <Intermediate>0</Intermediate>
                <Minor>0</Minor>
            </Version>
            <ReturnTransitAndCommit>true</ReturnTransitAndCommit>
            <RequestedShipment>
                <ShipTimestamp>2020-11-13T14:34:16.160183+08:00</ShipTimestamp>
                <DropoffType>REGULAR_PICKUP</DropoffType>
                <ServiceType>FEDEX_GROUND</ServiceType>
                <PackagingType>YOUR_PACKAGING</PackagingType>
                <PreferredCurrency>USD</PreferredCurrency>
                <Shipper>
                    <AccountNumber>983144837</AccountNumber>
                    <Contact>
                        <PersonName>Donovan</PersonName>
                        <CompanyName>ANL</CompanyName>
                        <PhoneNumber>6262258083</PhoneNumber>
                        <EMailAddress>donovan.xu@longyuan-sh.com</EMailAddress>
                    </Contact>
                    <Address>
                        <StreetLines>16018 Adelante st Suite D</StreetLines>
                        <City>Irwindale</City>
                        <StateOrProvinceCode>CA</StateOrProvinceCode>
                        <PostalCode>91702</PostalCode>
                        <CountryCode>US</CountryCode>
                    </Address>
                </Shipper>
                <Recipient>
                    <Contact>
                        <PersonName>Alex</PersonName>
                        <CompanyName>ANL</CompanyName>
                        <PhoneNumber>8000000000</PhoneNumber>
                        <EMailAddress>alex.cao@longyuan-sh.com</EMailAddress>
                    </Contact>
                    <Address>
                        <StreetLines>401 Independence Rd</StreetLines>
                        <City>FLORENCE</City>
                        <StateOrProvinceCode>NJ</StateOrProvinceCode>
                        <PostalCode>08518</PostalCode>
                        <CountryCode>US</CountryCode>
                    </Address>
                </Recipient>
                <ShippingChargesPayment>
                    <PaymentType>SENDER</PaymentType>
                    <Payor>
                        <ResponsibleParty>
                            <AccountNumber>983144837</AccountNumber>
                            <Contact>
                                <PersonName>Donovan</PersonName>
                                <CompanyName>ANL</CompanyName>
                                <PhoneNumber>6262258083</PhoneNumber>
                                <EMailAddress>donovan.xu@longyuan-sh.com</EMailAddress>
                            </Contact>
                            <Address>
                                <StreetLines>16018 Adelante st Suite D</StreetLines>
                                <City>Irwindale</City>
                                <StateOrProvinceCode>CA</StateOrProvinceCode>
                                <PostalCode>91702</PostalCode>
                                <CountryCode>US</CountryCode>
                            </Address>
                        </ResponsibleParty>
                    </Payor>
                </ShippingChargesPayment>
                <RequestedPackageLineItems>
                    <SequenceNumber>1</SequenceNumber>
                    <GroupPackageCount>1</GroupPackageCount>
                    <Weight>
                        <Units>LB</Units>
                        <Value>20</Value>
                    </Weight>
                    <Dimensions>
                        <Length>40</Length>
                        <Width>30</Width>
                        <Height>20</Height>
                        <Units>IN</Units>
                    </Dimensions>
                    <CustomerReferences>
                        <CustomerReferenceType>CUSTOMER_REFERENCE</CustomerReferenceType>
                        <Value>xxxx</Value>
                    </CustomerReferences>
                    <SpecialServicesRequested>
                        <SpecialServiceTypes>SIGNATURE_OPTION</SpecialServiceTypes>
                        <SignatureOptionDetail>
                            <OptionType>DIRECT</OptionType>
                        </SignatureOptionDetail>
                    </SpecialServicesRequested>
                </RequestedPackageLineItems>
            </RequestedShipment>
        </RateRequest>
    </Body>
</Envelope>